brew "ag"
brew "bat"
brew "ctags"
brew "exa"
brew "fasd"
brew "fzf"
brew "git"
brew "gitup"
brew "go"
brew "httpie"
brew "hub"
brew "jrnl"
brew "legit"
brew "macvim", args: ["with-luajit", "with-python3", "with-override-system-vim"]
brew "mono"
brew "neovim"
brew "node"
brew "pipenv"
brew "pyenv"
brew "python"
brew "rbenv"
brew "rg"
brew "ruby"
brew "rustup"
brew "stow"
brew "thefuck"
brew "tmux"
brew "tmuxinator-completion"
brew "yarn"

cask "alacritty"
cask "alfred"
cask "docker"
cask "dropbox"
cask "gpg-suite"
cask "keybase"
cask "visual-studio-code"

tap "homebrew/cask"
tap "homebrew/cask-fonts"
cask "font-hack"

tap "d12frosted/emacs-plus"
brew "emacs-plus"

tap "kryptco/tap"
brew "kr"
