brew "ag"
brew "bat"
brew "ctags"
brew "elasticsearch", restart_service: :changed
brew "exa"
brew "fasd"
brew "fzf"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "go"
brew "httpie"
brew "hub"
brew "jenv"
brew "kubectl"
brew "legit"
brew "m-cli"
brew "macvim"
brew "mas"
brew "neovim"
brew "node"
brew "nvm"
brew "pyenv"
brew "python"
brew "rbenv"
brew "redis", restart_service: :changed
brew "rg"
brew "ruby"
brew "rustup"
brew "starship"
brew "stow"
brew "thefuck"
brew "tmux"
brew "tmuxinator-completion"
brew "yarn"

cask "1password"
cask "alacritty"
cask "alfred"
cask "chromedriver"
cask "dash"
cask "docker"
cask "dotnet-sdk"
cask "dropbox"
cask "firefox"
cask "gitup"
cask "google-chrome"
cask "gpg-suite"
cask "keybase"
cask "minecraft"
cask "postgres"
cask "slack"
cask "visual-studio-code"

tap "AdoptOpenJDK/openjdk"
cask "adoptopenjdk14-openj9"

tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"
cask "font-jetbrainsmono-nerd-font"

tap "d12frosted/emacs-plus"
brew "emacs-plus"

tap "kryptco/tap"
brew "kr"

mas "Todoist", id: 585829637
