brew "ag"
brew "bat"
brew "ctags"
brew "exa"
brew "fasd"
brew "fzf"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "go"
brew "httpie"
brew "hub"
brew "jenv"
brew "legit"
brew "macvim"
brew "neovim"
brew "nvm"
brew "pyenv"
brew "python"
brew "rbenv"
brew "rg"
brew "ruby"
brew "rustup"
brew "starship"
brew "stow"
brew "thefuck"
brew "tmux"
brew "tmuxinator-completion"

cask "alacritty"
cask "alfred"
cask "dash"
cask "docker"
cask "dropbox"
cask "gitup"
cask "gpg-suite"
cask "keybase"
cask "visual-studio-code"

tap "homebrew/cask-fonts"
cask "font-hack"

tap "d12frosted/emacs-plus"
brew "emacs-plus"

tap "kryptco/tap"
brew "kr"
