brew "bat"
brew "chezmoi"
brew "exa"
brew "fd"
brew "fish"
brew "fnm"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-delta"
brew "git-lfs"
brew "gpg2"
brew "jq"
brew "m-cli"
brew "neovim"
brew "node"
brew "pam-reattach"
brew "pinentry-mac"
brew "python"
brew "rbenv"
brew "redis"
brew "rg"
brew "ruby"
brew "ruby-build"
brew "rustup"
brew "starship"
brew "tmux"
brew "yarn"
brew "yq"

cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alfred"
cask "dash"
cask "hey"
cask "nordvpn"
cask "postgres-unofficial"
cask "visual-studio-code"

cask "homebrew/cask-fonts/font-caskaydia-cove-nerd-font"
cask "homebrew/cask-fonts/font-jetbrains-mono-nerd-font"
