brew "asdf"
brew "bat"
brew "chezmoi"
brew "exa"
brew "fd"
brew "fish"
brew "fnm"
brew "fzf"
brew "gh"
brew "gpg2"
brew "jq"
brew "neovim"
brew "node"
brew "pam-reattach"
brew "pinentry-mac"
brew "rg"
brew "rustup"
brew "tmux"
brew "yarn"
brew "yq"

cask "1password-beta"
cask "1password-cli-beta"
cask "alacritty"
cask "postgres-unofficial"

cask "homebrew/cask-fonts/font-jetbrains-mono-nerd-font"
