brew "bat"
brew "exa"
brew "fd"
brew "fish"
brew "gpg2"
brew "jq"
brew "pam-reattach"
brew "pinentry-mac"
brew "rg"
brew "rustup"
brew "tmux"
brew "yq"

cask "1password-beta"
cask "1password-cli-beta"
cask "postgres-unofficial"
